@echo off
chcp 65001 >nul
title Запуск веб-платформи "Затишок"
echo ===================================================
echo     Встановлення необхідних бібліотек (один раз)
echo ===================================================
pip install -r requirements.txt --quiet
echo.
echo ===================================================
echo     Запуск локального сервера...
echo ===================================================
echo Сервер запущено! Не закривайте це чорне вікно.
echo Сайт автоматично відкриється у вашому браузері.
echo.
start http://127.0.0.1:5000
python app.py
pause
